Repository: sambar-fgfs/Kanboard-documentation-ja
Catalog: resource/kanboard-documentation-ja.tmx
Source language: en_us
Languages: ja

source: Test with Postgresql ~~~~~~~~~~~~~~~~~~~~
ja: PostgreSQL を使用したテスト ~~~~~~~~~~~~~~~~~~~~

source: - New comment = **c**
ja: - コメントを追加 = **c**

source: The end-user start to type the group name in the auto-complete field 2.
ja: エンドユーザーがグループ名をオートコンプリートのフィールドに入力を始める 2.

source: Install Kanboard:
ja: Kanboardのインストール:

source: worker Execute queue worker
ja: worker キューワーカーを実行する

source: Task highlighting ~~~~~~~~~~~~~~~~~
ja: タスクのハイライト ~~~~~~~~~~~~~~~~~

source: Source code -----------
ja: ソースコード -----------

source: Be sure to configure your server to allow Kanboard to send emails and make external network requests, for example with SELinux:
ja: 必ず、Kanboardに対してEmail送信と外部ネットワークへリクエストを送ることを許容するようにサーバーを設定してください。SELinuxの例:

source: Class: ``Kanboard\Core\Ldap\User``
ja: クラス: ``Kanboard\Core\Ldap\User``

source: // Mysql/Postgres custom port (null = default port) define('DB_PORT', null);
ja: // Mysql/Postgres のポート番号 (null = デフォルトのポート) define('DB_PORT', null);

source: - ``getExternalIdColumn()``: Get external id column name (google_id, github_id, gitlab_id…)
ja: - ``getExternalIdColumn()``: 外部IDのカラム名を取得する (google_id, github_id, gitlab_id…)

source: Your reverse proxy authenticates the user and send the username through a HTTP header.
ja: リバースプロキシ認証のユーザーは、ユーザー名をHTTPヘッダを通して送ります。

source: Interface to implement: ``Kanboard\Core\Group\GroupBackendProviderInterface``.
ja: ``Kanboard\Core\Group\GroupBackendProviderInterface`` にインターフェースが実装されています。

source: // SMTP configuration to use when the "smtp" transport is chosen
ja: // "smtp" での送信を選んだときに使用するSMTPの設定

source: // LDAP properties define('LDAP_USER_BASE_DN', 'ou=People,dc=example,dc=com'); define('LDAP_USER_FILTER', 'uid=%s');
ja: // LDAP プロパティ define('LDAP_USER_BASE_DN', 'ou=People,dc=example,dc=com'); define('LDAP_USER_FILTER', 'uid=%s');

source: // See https://www.php.net/manual/en/session.customhandler.php
ja: // 詳細は https://www.php.net/manual/en/session.customhandler.php を参照願います。

source: From there, you can add a new swimlane or rename the default one.
ja: ここから、新しいスイムレーンを追加したり、既存のスイムレーンの名前を変更できます。

source: - Purpose: **Revoke user access to a project**
ja: - 用途: **ユーザーからプロジェクトへのアクセス権を剥奪する**

source: Select an event 3.
ja: イベントを選択する 3.

source: Project Permission API Procedures =================================
ja: プロジェクトの権限のAPIプロシージャ =================================

source: You can also change manually the value of the time spent field when you edit a subtask.
ja: また、サブタスクを編集する時に経過時間のフィールドの値を手動で変更できます。

source: Session -------
ja: セッション -------

source: To add a new user, you must be an administrator.
ja: 新規ユーザーを追加するには、管理者でなければなりません。

source: +-----------------------------------+-----------------------------------+ | Role | Description | +===================================+===================================+ | Administrator | Access to everything | +-----------------------------------+-----------------------------------+ | Manager | Can create team projects but | | | cannot change application | | | settings | +-----------------------------------+-----------------------------------+ | User | Can create private projects only | +-----------------------------------+-----------------------------------+
ja: +-----------------------------------+-----------------------------------+ | 役割 | 概要 | +===================================+===================================+ | システム管理者 | 全てにアクセス可能 | +-----------------------------------+-----------------------------------+ | 組織の管理者 | チームプロジェクトの作成は可能だが、 | | | アプリケーションの設定は | | | 変更不可 | +-----------------------------------+-----------------------------------+ | ユーザー | プライベートプロジェクトのみ作成可能 | +-----------------------------------+-----------------------------------+

source: // Example for OpenLDAP: 'uid'
ja: // OpenLDAPでの例: 'uid'

source: list Lists commands
ja: list コマンドのリスト

source: Unzip the files to ``C:\php`` 3.
ja: ``C:\php`` にファイルを展開する 3.

source: - ``$start`` Calendar start date (string, ISO-8601 format)
ja: - ``$start`` カレンダーの開始日 (string, ISO-8601 書式)

source: You can also define routes with variables:
ja: ルートの定義には変数を併用することもできます:

source: Available actions -----------------
ja: 利用可能なアクション -----------------

source: // Return a dictionary of metadata (keys/values) for the $task_id
ja: // $task_id :連想配列のメタデータ (キー/値)

source: - **Column**: The column where the task will be created, your task will be positioned at the bottom.
ja: - **カラム**: タスクの作成先のカラムを指定します。タスクはそのカラムの一番下に置かれます。

source: // Disabling logout (for external SSO authentication) define('DISABLE_LOGOUT', false);
ja: // (外部シングルサインオン認証を使用している場合のための)ログアウト無効化 define('DISABLE_LOGOUT', false);

source: Cron job URL (with URL rewriting enabled): ``https://domain.tld/cronjob?token=WEBHOOK_TOKEN_HERE``
ja: Cron job のURL (URL rewriteが有効な場合)は: ``https://domain.tld/cronjob?token=WEBHOOK_TOKEN_HERE`` です。

source: figure:: /_static/project-view.png :alt: Project overview
ja: figure:: /_static/project-view.png :alt: プロジェクト概要

source: You can use ``cookiecutter`` to create the project structure of your plugin automatically.
ja: プラグインで自動的にプロジェクトの構造を作成するには ``cookiecutter`` が利用できます。

source: figure:: /_static/project-disable-sharing.png :alt: Disable public access
ja: figure:: /_static/project-disable-sharing.png :alt: 公開アクセスの無効化

source: - Result on failure: **null**
ja: - 失敗時の返り値: **null**

source: - Result on failure: **false**
ja: - 失敗時の返り値: **false**

source: Avoid hosting providers that use a shared NFS mount point.
ja: 共有NFSマウントポイントを使用しているホスティングサービスは避けてください。

source: - Do not allow everybody to access to the directory ``data`` from the URL.
ja: - ``data`` ディレクトリへはURLから誰でもアクセス出来るようにしないでください。

source: To configure swimlanes go to the **project configuration page** and choose the section **Swimlanes**.
ja: スイムレーンを設定するには、 **プロジェクトの設定** ページを開き、 **スイムレーン** のセクションを選択してください。

source: Debug Mode ~~~~~~~~~~
ja: デバッグモード ~~~~~~~~~~

source: Class: ``Kanboard\Core\Ldap\Client``
ja: クラス: ``Kanboard\Core\Ldap\Client``

source: Search by subtask assignee ~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: サブタスクの担当者で検索 ~~~~~~~~~~~~~~~~~~~~~~~~~~

source: - The Zip extension must be available on your server
ja: - サーバー上でZip extensionが利用可能になっていること

source: - The intersection with the user timetable is also calculated.
ja: - また、セクション内でユーザーのタイムテーブルも計算されます。

source: - **swimlane_id** (integer, required)
ja: - **swimlane_id** (integer, 必須)

source: Internal Task Link API Procedures =================================
ja: タスクの内部リンクのプロシージャ =================================

source: Classes:
ja: クラス:

source: The breakdown of all records is visible in the task view page:
ja: 全ての記録の分析はタスクビューページで閲覧可能です。

source: * Item 3
ja: * 項目3

source: - Password: user password or personal access token
ja: - Password: ユーザーのパスワードor個人のアクセストークン

source: Swimlane API Procedures =======================
ja: スイムレーンのAPIプロシージャ =======================

source: - Encoding: UTF-8
ja: - 文字コード: UTF-8

source: * Item 1
ja: * 項目1

source: * Item 2
ja: * 項目2

source: Kanboard is pre-configured to work with Apache (URL rewriting).
ja: Kanboard はApacheで(URL rewritingが)動くように予め設定されています。

source: - Command-Control-Shift-4, then space, then click a window: Take a screenshot of a window and save it to the clipboard
ja: - Command-Control-Shift-4, を押してから、スペースキーを押し、ウインドウをクリックする: ウインドウ単体のスクリーンショットがクリップボードに保存される

source: Example to override default values for task forms:
ja: タスクのフォームのデフォルト値をオーバーライドする例:

source: Occasionally, it’s possible to optimize the database file by running the command ``VACUUM``.
ja: 時々 ``VACUUM`` コマンドを実行することで、データベースを最適化できます。

source: - If nobody manifested any interest to develop your feature request, then there is no point of keeping it open.
ja: - あなたのリクエストに明確に興味を示す人が誰も居ない場合、オープンで維持しても意味がありません。

source: Test with Mysql ~~~~~~~~~~~~~~~
ja: MySql を使用したテスト ~~~~~~~~~~~~~~~~

source: - Search tasks due with the exact date: ``due:2015-06-29``
ja: - 期限を正確な日付でタスクを検索: ``due:2015-06-29``

source: - ``Kanboard\Core\ExternalTask\AccessForbiddenException``: Access not allowed by the external system
ja: - ``Kanboard\Core\ExternalTask\AccessForbiddenException``: 外部システムへのアクセスが許容されていない

source: - Purpose: **Get logged user session**
ja: - 用途: **ユーザーのセッションにログイン**

source: - Parameters:
ja: - パラメーター:

source: Proxy Mode ~~~~~~~~~~
ja: Proxy モード ~~~~~~~~~~

source: Plugin folder:
ja: プラグインフォルダ:

source: Let’s say we have two projects: “Ideas” and “Development”.
ja: “構想” と “開発”の2つのプロジェクトが存在するケースで説明します。

source: - View list of project members.
ja: - プロジェクトメンバーの一覧が見えます。

source: The application language can be changed at anytime.
ja: アプリケーションの言語はいつでも変更できます。

source: - Use a local email relay with Postfix and use the “mail” transport
ja: - “mail” の設定を使用し、PostfixでローカルのEmailの中継を使用する

source: Plugin Registration ===================
ja: プラグインの登録 ===================

source: Translations ============
ja: 翻訳 ============

source: - Single phase (just a list of items)
ja: - 単一のフェーズ (アイテムのリストのみ)

source: Examples of event payloads ~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: イベントのペイロードの例 ~~~~~~~~~~~~~~~~~~~~~~~~~~

source: These events can be used by other components of Kanboard like automatic actions.
ja: これらのイベントは自動アクションのようなKanboardの他のコンポーネントで使われる可能性があります。

source: - Avoid introducing new dependencies.
ja: - 新しい依存関係の追加は避けてください。

source: This is a PHP limitation.
ja: これはPHPの制限です。

source: To avoid any issues or potential timeouts, you can initialize the database directly by importing the SQL schema:
ja: いかなるissueもしくはタイムアウトの可能性を排除するため、SQLスキーマをインポートすることでデータベースの初期化を行うことができます:

source: +------------------------------+-------------------------------------------------+ | Method | Usage | +==============================+=================================================+ | ``getName()`` | Get provider name (label) | +------------------------------+-------------------------------------------------+ | ``getType()`` | Get link type (will be saved in the database) | +------------------------------+-------------------------------------------------+ | ``getDependencies()`` | Get a dictionary of supported dependency types | | | by the provider | +------------------------------+-------------------------------------------------+ | ``setUserTextInput($input)`` | Set text entered by the user | +------------------------------+-------------------------------------------------+ | ``match()`` | Return true if the provider can parse correctly | | | the user input | +------------------------------+-------------------------------------------------+ | ``getLink()`` | Get the link found with the properties | +------------------------------+-------------------------------------------------+
ja: +------------------------------+-------------------------------------------------+ | Method | Usage | +==============================+=================================================+ | ``getName()`` | プロバイダ名 (label) を取得 | +------------------------------+-------------------------------------------------+ | ``getType()`` | リンクのタイプを取得 (して、データベースに保存) | +------------------------------+-------------------------------------------------+ | ``getDependencies()`` | プロバイダによってサポートされている | | | 依存タイプの連想配列を取得 | +------------------------------+-------------------------------------------------+ | ``setUserTextInput($input)`` | ユーザーによって入力されたテキストをセットする | +------------------------------+-------------------------------------------------+ | ``match()`` | ユーザーの入力をプロバイダが正しくパースした場合に | | | trueを返す | +------------------------------+-------------------------------------------------+ | ``getLink()`` | プロパティからリンクを見つけて取得 | +------------------------------+-------------------------------------------------+

source: Do not forget to set the time zone:
ja: タイムゾーンの設定を忘れないでくささい:

source: Visual C++ Redistributable Installation ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: Visual C++ Redistributable のインストール ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: - Send only one pull-request for each feature or bug fix.
ja: - 各々の特徴orバグ修正には、1つのプルリクエストのみを送ってください。

source: - Stop the worker if you use it
ja: - workerを使用している場合、停止する

source: figure:: /_static/add-subtask.png :alt: Add a subtask
ja: figure:: /_static/add-subtask.png :alt: サブタスクを追加

source: Kanboard supports RSS feeds for projects and users.
ja: KanboardはプロジェクトとユーザーについてのRSSフィードをサポートしています。

source: Cache parameters ----------------
ja: キャッシュのパラメータ ----------------

source: Search by project ~~~~~~~~~~~~~~~~~
ja: プロジェクトで検索 ~~~~~~~~~~~~~~~~~

source: - No access to procedures that starts with “My…” (example: “getMe” or“getMyProjects”)
ja: - "My・・・"で始まるプロシージャにはアクセスできない (例:“getMe” or“getMyProjects”)

source: - **label** (integer, required)
ja: - **label** (integer, 必須)

source: The list of application events is available in the class ``Kanboard\Core\Event\EventManager::getAll()``.
ja: アプリケーションのイベントのリストは ``Kanboard\Core\Event\EventManager::getAll()`` クラスで利用可能です・

source: - If the task title is too long, you can put your mouse over the task to show a tooltip with the full title.
ja: - タスクのタイトルが長すぎる場合、タスクの上にマウスを移動すれば、ツールチップで完全なタイトルを表示します。

source: - Purpose: **Remove a swimlane**
ja: - 用途: **スイムレーンを削除する**

source: - User authentication
ja: - ユーザー認証

source: -h, --help Display this help message
ja: -h, --help このヘルプメッセージを表示する

source: Private projects cannot define permissions.
ja: プライベートプロジェクトでは権限を定義できません。

source: I want to translate Kanboard ----------------------------
ja: Kanboardを翻訳したい ----------------------------

source: // Enable or disable "Strict-Transport-Security" HTTP header
ja: // "Strict-Transport-Security" HTTP ヘッダの有効化/無効化

source: Only the registration file ``Plugin.php`` is required.
ja: プラグインの登録ファイルの ``Plugin.php`` のみが必要です。

source: A new task will be created with the same properties as the original.
ja: 複製元と同じプロパティの新しいタスクが作成されます。

source: Task Distribution -----------------
ja: タスク分布 -----------------

source: Building Assets (Javascript and CSS files) ==========================================
ja: ビルドのためのアセット (Javascript と CSS ファイル) ==========================================

source: - Result on success: **metadata value**
ja: - 成功時の返り値: **メタデータの値**

source: Installation on Debian ======================
ja: Debianへのインストール ======================

source: // Enable LDAP authentication (false by default) define('LDAP_AUTH', false);
ja: // LDAP 認証を有効にする (デフォルトは false ) define('LDAP_AUTH', false);

source: However, it will be possible in other columns.
ja: しかし、それ以外のカラムでは可能です。

source: Example to attach a template with local variables:
ja: テンプレートにローカル変数を付ける例:

source: Links -----
ja: リンク -----

source: - **username** (string, optional)
ja: - **username** (string, 任意)

source: Example: ``movedRange:2018/01/21..2018/01/31`` or ``movedRange:"2018-01-21..2018-01-31"``
ja: 例: ``movedRange:2018/01/21..2018/01/31`` か ``movedRange:"2018-01-21..2018-01-31"``

source: - Parameters: **none**
ja: - パラメータ: **無し**

source: Sender Email Address ~~~~~~~~~~~~~~~~~~~~
ja: 送信者の Email アドレス ~~~~~~~~~~~~~~~~~~~~

source: Kanboard exposes an instance of the object ``Symfony\Component\Console\Application`` via ``$this->cli``.
ja: ``$this->cli`` 経由で インスタンスのオブジェクト ``Symfony\Component\Console\Application`` が Kanboard に示されます。

source: - Sending notifications to external services
ja: - 外部サービスに通知を送る

source: Duplicating and Moving Tasks ----------------------------
ja: タスクの移動と複製 ----------------------------

source: - The lead time is the time between the task creation and the date of completion.
ja: - リードタイムは、「タスクがつくられてから、完了するまでの間の時間」です。

source: However, you can use external tools like `fail2ban <http://www.fail2ban.org>`__ to avoid massive scans.
ja: しかしながら、大規模なスキャンを防ぐために `fail2ban <http://www.fail2ban.org>`__ のような外部ツールを使用できます。

source: Download the source code and copy the directory ``kanboard`` where you want 3.
ja: ソースコードをダウンロードして、 ``kanboard`` ディレクトリを適切な場所にコピーしてください。 3.

source: - **opposite_label** (integer, optional)
ja: - **opposite_label** (integer, 任意)

source: - Purpose: **Enable a swimlane**
ja: - 用途: **スイムレーンを有効化する**

source: - This is to simplify Kanboard release process.
ja: - これはKanboardのリリースプロセスを単純化するためです。

source: This command rebuild the entire database and can be used for several reasons:
ja: このコマンドはデータベース全体を再構築するので、様々な理由で使用され得ます。 :

source: - Purpose: **Stop subtask timer for a user**
ja: - 用途: **サブタスクのタイマーを止める**

source: // The default domain to assume for the email address.
ja: // Emailアドレスはデフォルトのドメインであると仮定します。

source: Docker Tags -----------
ja: Docker タグ -----------

source: - Project calendar
ja: - プロジェクトのカレンダー

source: - **task_link_id** (integer, required)
ja: - **task_link_id** (integer, 必須)

source: For example, an external system can be a bug tracker or any kind of ticketing software.
ja: 例えば、外部システムにはバグトラッカーやいかなる種類のチケットシステムが使用可能です。

source: - You are using Microsoft Windows Server and IIS
ja: - Microsoft Windows Server と IISを使用している

source: - Result on success: **list of files**
ja: - 成功時の返り値: **list of files**

source: Example with cURL -----------------
ja: cURLを使用する例 -----------------

source: - **swimlane_id** (integer, optional)
ja: - **swimlane_id** (integer, 任意)

source: Tasks have two fields:
ja: タスクには2つのフィールドがあります:

source: Contributing to the open source project.
ja: このオープンソースプロジェクトに貢献する

source: Client ------
ja: クライアント ------

source: - Reduce the file size, deleting data produce empty space but doesn’t change the file size.
ja: - データを削除しても空白のスペースが発生しファイルサイズが変わらないのを、ファイルサイズを小さくします。

source: - Username: **root**
ja: - ユーザー名: **root**

source: - Indentation: 4 spaces
ja: - インデント: スペース 4 文字

source: Works in the same way as the modification date queries.
ja: 変更日の検索クエリと同じように動きます。

source: figure:: /_static/subtask-user-restriction.png :alt: Subtask user restriction
ja: figure:: /_static/subtask-user-restriction.png :alt: サブタスクの制限

source: FreeBSD Installation =======================
ja: FreeBSD へのインストール =======================

source: - Access to the API with the user credentials (username and password)
ja: - ユーザーの資格情報(ユーザー名とパスワード)を使用してAPIにアクセスする

source: Search events by task title ~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: タスク名でイベントを検索 ~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: figure:: /_static/example-restriction-task-status.png :alt: Example restriction task status
ja: figure:: /_static/example-restriction-task-status.png :alt: タスクの状態変更の制限の例

source: Request example to remove metada of a task by name:
ja: 名前でタスクのメタデータを削除するリクエストの例:

source: Interface to implement: ``Kanboard\Core\Group\GroupProviderInterface``.
ja: ``Kanboard\Core\Group\GroupProviderInterface`` にインターフェースが実装されています。

source: figure:: /_static/task-screenshot.png :alt: Screenshot page
ja: figure:: /_static/task-screenshot.png :alt: スクリーンショットの貼付けページ

source: Generate a HTML link ~~~~~~~~~~~~~~~~~~~~
ja: HTML のリンクを生成する ~~~~~~~~~~~~~~~~~~~~

source: The development of a native mobile application is let to the community.
ja: ネイティブモバイルアプリケーションの開発はコミュニティで行っています。

source: In this case, the constant ``LDAP_USERNAME`` is used as a pattern to the ldap username, examples:
ja: このケースでは、 ``LDAP_USERNAME`` 定数はLDAPユーザーネームを使用するパターンマッチングになっており、例えば:

source: - Developing and maintaining a software takes a lot of time.
ja: - ソフトウェアの開発とメンテナンスには多くの工数が掛かります。

source: +--------------+-------------------------------------------------------+ | Tag | Description | +==============+=======================================================+ | latest | Latest stable release | +--------------+-------------------------------------------------------+ | v1.2.x | Specific version of Kanboard | +--------------+-------------------------------------------------------+
ja: +--------------+-------------------------------------------------------+ | タグ | 概要 | +==============+=======================================================+ | latest | 最新の安定リリース | +--------------+-------------------------------------------------------+ | v1.2.x | Kanboardの特定バージョン | +--------------+-------------------------------------------------------+

source: Kanboard offers 4 different formats:
ja: Kanboard は4つの書式が利用できます:

source: - The end date of the event is the date of completion.
ja: - イベントの終了日は完了日になります。

source: - The due date can be recalculated automatically
ja: - その期限日は自動的に再計算されます。

source: Reference hooks ---------------
ja: フックの参照 ---------------

source: The best way to avoid this issue is to disable eAccelerator or define manually which files you want to cache with the config parameter ``eaccelerator.filter``.
ja: この問題を回避する最善の方法は、eAccelaratorを無効にするか、 ``eaccelerator.filter`` の設定パラメータでどのファイルをキャッシュしたいかを手動で定義してください。

source: - **title** (integer, optional)
ja: - **title** (integer, 任意)

source: To update a translation, send a pull-request to the corresponding project.
ja: 翻訳を更新するには、対応するプロジェクトにプルリクエストを送ってください。

source: Fetch groups in one line:
ja: グループについて1行で取得:

source: Custom HTTP header ------------------
ja: カスタム HTTP ヘッダー ------------------

source: - The task time spent and time estimated is updated automatically according to the sum of all subtasks.
ja: - タスクの経過時間と見積時間は全てのサブタスクの合計に従って自動的に更新されます。

source: - You can also convert a multiple-user project to a private project.
ja: - また、チームプロジェクトをプライベートプロジェクトに変更することもできます。

source: You can use an alternative HTTP header for the authentication if your server have a very specific configuration.
ja: もしサーバーが非常に特殊な設定をしている場合、代替のHTTPヘッダーを認証に使用できます。

source: - Open your web browser to use Kanboard http://localhost/kanboard/
ja: - Kanboardを使うために、 http://localhost/kanboard/ をブラウザで開く

source: By default, Centos 7 use PHP 5.4.16 and Apache 2.4.6.
ja: デフォルトでは、 Centos 7 は PHP 5.4.16 と Apache 2.4.6 を使用します

source: By default, log messages are sent to the web server logs.
ja: デフォルトでは、ログメッセージはwebサーバーのログとして送られます。

source: Groups can be managed from **User management > View All Groups**.
ja: **ユーザー管理 > 全てのグループを表示** から、グループの管理を行えます。

source: - **duplicates** \| is duplicated by
ja: - **次に重複しています** \| 次に重複しています

source: You must adjust the list of users according to your needs.
ja: 必要に応じて、ユーザーの権限を変更してください。

source: Database settings -----------------
ja: データベースの設定 -----------------

source: This is also possible to link tasks across projects.
ja: また、プロジェクトを跨いでタスクをリンクすることも可能です。

source: Logging -------
ja: ログ生成 -------

source: - Emails
ja: - Email

source: - All tasks
ja: - 全てのタスク

source: Users that belong to this role will be able to move tasks only between the column “Ready” and “Work in progress”.
ja: この役割を割り当てられたユーザーは、カラム"Ready"と"Work in progress"間でのみタスクを移動できます。

source: Always use a modern browser with the latest version if possible:
ja: 可能なら最新版の現代的なブラウザを常に使用してください:

source: - Example: ``subtask:assignee:"John Doe"``
ja: - 例: ``subtask:assignee:"John Doe"``

source: For example, you can use these applications:
ja: 例えば、これらのアプリケーションがあります:

source: Technically this process is done by Ajax polling.
ja: 技術的には Ajax polling でこのプロセスを行います。

source: $this->request->getStringParam('my_variable'); // Return foobar
ja: $this->request->getStringParam('my_variable'); // foobar を返す

source: Let’s say we have a domain ``KANBOARD`` (kanboard.local) and the primary controller is ``myserver.kanboard.local``.
ja: 我々のドメイン名が ``KANBOARD`` (kanboard.local) で、プライマリコントローラが ``myserver.kanboard.local`` の場合を述べます。

source: On the right, choose “Create Task” 4.
ja: 右枠内の “タスクの作成”を選択する 4.

source: Examples:
ja: 例:

source: "id": 1769674782,
ja: d"id": 1769674782,

source: - ``LDAP_GROUP_PROVIDER``: Enable the LDAP group provider
ja: - ``LDAP_GROUP_PROVIDER``: LDAPグループプロバイダを有効にする

source: Kanboard provides a LDAP group provider to sync automatically groups from LDAP servers.
ja: Kanboardは 自動的にグループをLDAPサーバーと同期するために、LDAPグループプロバイダを提供します。

source: Documentation of API endpoints.
ja: APIのエンドポイントに関する文書です。

source: - Tasks created by the user id #1: ``creator:1``
ja: - ユーザーID #1が作成したタスク: ``creator:1``

source: Generate links based on the routing table -----------------------------------------
ja: ルーティングテーブルに基づいたリンクの生成 -----------------------------------------

source: - Phone screens
ja: - 書類審査
